doc/use_cases/backing_up_documents.org
:PROPERTIES:
:ID:       f8a2b3c4-d5e6-7890-abcd-ef1234567891
:END:
#+language: en
#+EXPORT_FILE_NAME: ./backing_up_documents.md
#+SUBTITLE: Building a backup system with hierarchical commands, flows, parameters, and per-project configuration

#+CALL: ../../lp.org:check-result()

#+name: init
#+BEGIN_SRC bash :results none :exports none :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
  . ./sandboxing.sh
#+END_SRC

I have years of personal documents - notes, scanned papers, receipts, photos of
whiteboards. I want a command line tool to back them up reliably. This use case
shows how to build a document backup system with clk, starting simple and
growing as needs evolve.

* starting with a backup group

First, I need a group to hold all backup-related commands. I create a Python
group called ~backup~ that sets a ~BACKUP_DESTINATION~ environment variable. All
subcommands - even bash ones - will have access to it.

#+NAME: create-backup-group
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create python backup --group --description "Backup operations"
#+END_SRC

The code for the group looks like this:

#+NAME: backup-code
#+BEGIN_SRC python :results none :exports code
from clk.config import config
from clk.decorators import group, option


@group()
@option("--dest", default="/mnt/backup", help="Backup destination base directory")
def backup(dest):
    "Backup operations"
    config.override_env["BACKUP_DESTINATION"] = dest
    config.init()
#+END_SRC

#+NAME: create-backup
#+BEGIN_SRC bash :results none :exports none :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :noweb yes
cat <<'EOF' > "$(clk command which backup)"
#!/usr/bin/env python3
# -*- coding: utf-8 -*-

<<backup-code>>
EOF
#+END_SRC

The key line is ~config.override_env["BACKUP_DESTINATION"] = dest~. This makes
the ~BACKUP_DESTINATION~ environment variable available to all subcommands,
including bash commands.

Now I create a bash command to back up my docs. Since I want it nested under the
~backup~ group and inside a ~docs~ subgroup, I name it ~backup.docs.do~. clk
automatically creates the intermediate ~docs~ group.

#+NAME: create-backup-docs-do
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create bash backup.docs.do \
    --description "Backup documents to external drive" \
    --option '--source:str:Source directory:~/docs' \
    --body 'echo "Backing up documents from ${CLK___SOURCE} to ${BACKUP_DESTINATION}"'
#+END_SRC

Let's try it.

#+NAME: try-backup-docs-do
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: try-backup-docs-do
: Backing up documents from ~/docs to /mnt/backup

The bash command automatically has access to ~BACKUP_DESTINATION~ because the
parent group set it in ~config.override_env~.

The ~backup~ group now has a ~docs~ subgroup.

#+NAME: show-backup-help
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup --help
#+END_SRC

#+RESULTS[c68e489e34c5f4a54025f419fd5515006eeddcff]: show-backup-help
#+begin_example
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  docs  Automatically created group to organize subcommands
#+end_example

* persisting the destination

I always backup to the same external drive. Rather than typing ~--dest~ every
time, I persist it as a parameter on the ~backup~ group. Since ~BACKUP_DESTINATION~
is set from this option, all subcommands benefit.

#+NAME: set-dest-param
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk parameter set backup --dest /media/external/documents
#+END_SRC

#+RESULTS[8555946ca8d5464d5d5a7411e37254c12d2c78de]: set-dest-param
: New global parameters for backup: --dest /media/external/documents

Now the command uses my preferred destination automatically.

#+NAME: try-with-param
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: try-with-param
: Backing up documents from ~/docs to /media/external/documents

I can still override it when needed.

#+NAME: override-param
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup --dest /tmp/quick-backup docs do
#+END_SRC

#+RESULTS[aa4050eb6555f7616ebc106cfc53dce3b90101df]: override-param
: Backing up documents from ~/docs to /tmp/quick-backup

* adding more backup targets

My backup needs grow. I want to back up my database and photos too. I create
sibling commands under the ~backup~ group. They all use the same
~BACKUP_DESTINATION~ environment variable set by the group.

#+NAME: create-backup-database
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create bash backup.database \
    --description "Backup database" \
    --option '--db:str:Database name:main.db' \
    --body 'echo "Dumping database ${CLK___DB} to ${BACKUP_DESTINATION}"'
#+END_SRC

#+NAME: create-backup-photos
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create bash backup.photos \
    --description "Backup photos" \
    --option '--quality:str:Compression quality:high' \
    --body 'echo "Backing up photos with ${CLK___QUALITY} quality to ${BACKUP_DESTINATION}"'
#+END_SRC

Now my backup group has three commands.

#+NAME: show-backup-commands
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup --help
#+END_SRC

#+RESULTS[c68e489e34c5f4a54025f419fd5515006eeddcff]: show-backup-commands
#+begin_example
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  The current parameters set for this command are: --dest /media/external/documents

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  database  Backup database
  docs      Automatically created group to organize subcommands
  photos    Backup photos
#+end_example

#+NAME: try-all-backups
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup database
clk backup photos
#+END_SRC

#+RESULTS[299bcef965bc261666c9bfc8d1d55bccbef66c20]: try-all-backups
: Dumping database main.db to /media/external/documents
: Backing up photos with high quality to /media/external/documents

Notice how both commands use ~/media/external/documents~ - the destination I
persisted on the ~backup~ group. I didn't have to configure it on each command
separately.

