doc/use_cases/backing_up_documents.md
- [starting with a backup group](#org1b09af2)
- [persisting the destination](#org8d69ac8)
- [adding more backup targets](#orgda14215)
- [organizing with nested groups](#org8bac0ba)
- [chaining backups with flows](#org925c995)
- [creating a full backup alias](#org8098521)
- [shortcut aliases for common scenarios](#orgecc405e)
- [per-project backup configuration](#orgb73bc95)
- [personal preferences with a hostname extension](#org9e9eb34)
- [seeing everything at a glance](#orgbe45cf5)
- [summary](#org2582d36)

I have years of personal documents - notes, scanned papers, receipts, photos of whiteboards. I want a command line tool to back them up reliably. This use case shows how to build a document backup system with clk, starting simple and growing as needs evolve.


<a id="org1b09af2"></a>

# starting with a backup group

First, I need a group to hold all backup-related commands. I create a Python group called `backup` that sets a `BACKUP_DESTINATION` environment variable. All subcommands - even bash ones - will have access to it.

```bash
clk command create python backup --group --description "Backup operations"
```

The code for the group looks like this:

```python
from clk.config import config
from clk.decorators import group, option


@group()
@option("--dest", default="/mnt/backup", help="Backup destination base directory")
def backup(dest):
    "Backup operations"
    config.override_env["BACKUP_DESTINATION"] = dest
    config.init()
```

The key line is `config.override_env["BACKUP_DESTINATION"] = dest`. This makes the `BACKUP_DESTINATION` environment variable available to all subcommands, including bash commands.

Now I create a bash command to back up my docs. Since I want it nested under the `backup` group and inside a `docs` subgroup, I name it `backup.docs.do`. clk automatically creates the intermediate `docs` group.

```bash
clk command create bash backup.docs.do \
    --description "Backup documents to external drive" \
    --option '--source:str:Source directory:~/docs' \
    --body 'echo "Backing up documents from ${CLK___SOURCE} to ${BACKUP_DESTINATION}"'
```

Let's try it.

```bash
clk backup docs do
```

    Backing up documents from ~/docs to /mnt/backup

The bash command automatically has access to `BACKUP_DESTINATION` because the parent group set it in `config.override_env`.

The `backup` group now has a `docs` subgroup.

```bash
clk backup --help
```

```
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  docs  Automatically created group to organize subcommands
```


<a id="org8d69ac8"></a>

# persisting the destination

I always backup to the same external drive. Rather than typing `--dest` every time, I persist it as a parameter on the `backup` group. Since `BACKUP_DESTINATION` is set from this option, all subcommands benefit.

```bash
clk parameter set backup --dest /media/external/documents
```

    New global parameters for backup: --dest /media/external/documents

Now the command uses my preferred destination automatically.

```bash
clk backup docs do
```

    Backing up documents from ~/docs to /media/external/documents

I can still override it when needed.

```bash
clk backup --dest /tmp/quick-backup docs do
```

    Backing up documents from ~/docs to /tmp/quick-backup


<a id="orgda14215"></a>

# adding more backup targets

My backup needs grow. I want to back up my database and photos too. I create sibling commands under the `backup` group. They all use the same `BACKUP_DESTINATION` environment variable set by the group.

```bash
clk command create bash backup.database \
    --description "Backup database" \
    --option '--db:str:Database name:main.db' \
    --body 'echo "Dumping database ${CLK___DB} to ${BACKUP_DESTINATION}"'
```

```bash
clk command create bash backup.photos \
    --description "Backup photos" \
    --option '--quality:str:Compression quality:high' \
    --body 'echo "Backing up photos with ${CLK___QUALITY} quality to ${BACKUP_DESTINATION}"'
```

Now my backup group has three commands.

```bash
clk backup --help
```

```
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  The current parameters set for this command are: --dest /media/external/documents

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  database  Backup database
  docs      Automatically created group to organize subcommands
  photos    Backup photos
```

```bash
clk backup database
clk backup photos
```

    Dumping database main.db to /media/external/documents
    Backing up photos with high quality to /media/external/documents

Notice how both commands use `/media/external/documents` - the destination I persisted on the `backup` group. I didn't have to configure it on each command separately.
