doc/use_cases/backing_up_documents.org
* organizing with nested groups

As my backup system grows, I need sub-operations for documents. I want commands
to verify backups and retrieve files. I simply create commands with dots in
their names - clk automatically created the intermediate ~docs~ group when I
first created ~backup.docs.do~.

#+NAME: create-docs-verify
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create bash backup.docs.verify \
    --description "Verify backup integrity" \
    --body 'echo "Verifying backup integrity at ${BACKUP_DESTINATION}..."'
#+END_SRC

#+NAME: create-docs-retrieve
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk command create bash backup.docs.retrieve \
    --description "Retrieve a file from backup" \
    --argument 'filename:str:File to retrieve' \
    --body 'echo "Retrieving ${CLK___FILENAME} from ${BACKUP_DESTINATION}"'
#+END_SRC

Now ~backup docs~ is a group with several subcommands. All of them have access
to ~BACKUP_DESTINATION~ from the parent ~backup~ group.

#+NAME: show-docs-group
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs --help
#+END_SRC

#+RESULTS[ee8140f68d7a71aa77a808b5b993fe71da009823]: show-docs-group
#+begin_example
Usage: clk backup docs [OPTIONS] COMMAND [ARGS]...

  Automatically created group to organize subcommands

  This is a built in created group. To remove it, simply remove all its subcommands (with `clk command remove SUBCMD`,
  or `clk alias unset SUBCMD`). To rename it, simply rename them (with `clk command rename SUBCMD` or `clk alias rename
  SUBCMD`)

Options:
  --help-all  Show the full help message, automatic options included.
  --help      Show this message and exit.

Commands:
  do        Backup documents to external drive
  retrieve  Retrieve a file from backup
  verify    Verify backup integrity
#+end_example

I can call the backup command directly.

#+NAME: call-docs-do
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: call-docs-do
: Backing up documents from ~/docs to /media/external/documents

Or use the subcommands.

#+NAME: call-docs-subcommands
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs verify
clk backup docs retrieve important-notes.txt
#+END_SRC

#+RESULTS[0580cd3873a60dd6a8d264f1fb30146959d8cfe3]: call-docs-subcommands
: Verifying backup integrity at /media/external/documents...
: Retrieving important-notes.txt from /media/external/documents

* chaining backups with flows

My documents reference database entries, so I want to ensure the database is
backed up before backing up documents. I use flow dependencies.

#+NAME: set-flowdep
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk flowdep set backup.docs.do backup.database
#+END_SRC

#+RESULTS[6884ee47aab2752817f5ec08a49fe711cb34a802]: set-flowdep
: New global flowdep for backup.docs.do: backup.database

Now when I run ~backup docs do~ with ~--flow~, it first backs up the database.

#+NAME: run-with-flow
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do --flow
#+END_SRC

#+RESULTS[ca58910ff31b48f4cc81e37ff83469711e42490f]: run-with-flow
: Dumping database main.db to /media/external/documents
: Backing up documents from ~/docs to /media/external/documents

* creating a full backup alias

I want a single command to back up everything. I create an alias that chains all
backup commands.

#+NAME: create-full-alias
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk alias set backup.full backup database , backup docs do , backup photos
#+END_SRC

#+RESULTS[65dfa3e184653b1267c08eb8ef80907551f46357]: create-full-alias
: New global alias for backup.full: backup database , backup docs do , backup photos

#+NAME: run-full-backup
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup full
#+END_SRC

#+RESULTS[568a73df160aa2a1082c1a3ad8fe20f184154b5b]: run-full-backup
: Dumping database main.db to /media/external/documents
: Backing up documents from ~/docs to /media/external/documents
: Backing up photos with high quality to /media/external/documents

* shortcut aliases for common scenarios

I create aliases for frequent backup patterns.

#+NAME: create-shortcuts
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk alias set backup.quick backup docs do --source '~/notes'
clk alias set backup.work backup docs do --source '~/work/documents'
#+END_SRC

#+RESULTS[d6067778edf44b54be404dd547ae5632568ee655]: create-shortcuts
: New global alias for backup.quick: backup docs do --source '~/notes'
: New global alias for backup.work: backup docs do --source '~/work/documents'

#+NAME: try-shortcuts
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup quick
clk backup work
#+END_SRC

#+RESULTS[734a48c658572a54c68074500cfb567e1a050798]: try-shortcuts
: Backing up documents from ~/notes to /media/external/documents
: Backing up documents from ~/work/documents to /media/external/documents

* per-project backup configuration

Different projects have different backup needs. I use project-local parameters
so backup commands do the right thing depending on where I am.

#+NAME: setup-project-a
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
mkdir -p project-a && cd project-a && mkdir .clk
#+END_SRC

I set the source directory on the ~backup.docs.do~ command, and the destination
on the ~backup~ group. Since the destination is on the group, it affects all
backup commands in this project - documents, database, photos.

#+NAME: set-project-a-params
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk parameter set backup.docs.do --source ./documentation
clk parameter set backup --dest /mnt/backup/project-a
#+END_SRC

#+RESULTS[518b8bda1205e6df5385106c56757cb83f291133]: set-project-a-params
: New local parameters for backup.docs.do: --source ./documentation
: New local parameters for backup: --dest /mnt/backup/project-a

#+NAME: run-in-project-a
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: run-in-project-a
: Backing up documents from ./documentation to /mnt/backup/project-a

When I leave the project, global settings take over.

#+NAME: leave-project
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
cd ..
clk backup docs do
#+END_SRC

#+RESULTS[9569ad32ff5d8cf776686c91ebf0dcb8f9713495]: leave-project
: Backing up documents from ~/docs to /media/external/documents

