doc/use_cases/backing_up_documents.md


<a id="org8bac0ba"></a>

# organizing with nested groups

As my backup system grows, I need sub-operations for documents. I want commands to verify backups and retrieve files. I simply create commands with dots in their names - clk automatically created the intermediate `docs` group when I first created `backup.docs.do`.

```bash
clk command create bash backup.docs.verify \
    --description "Verify backup integrity" \
    --body 'echo "Verifying backup integrity at ${BACKUP_DESTINATION}..."'
```

```bash
clk command create bash backup.docs.retrieve \
    --description "Retrieve a file from backup" \
    --argument 'filename:str:File to retrieve' \
    --body 'echo "Retrieving ${CLK___FILENAME} from ${BACKUP_DESTINATION}"'
```

Now `backup docs` is a group with several subcommands. All of them have access to `BACKUP_DESTINATION` from the parent `backup` group.

```bash
clk backup docs --help
```

```
Usage: clk backup docs [OPTIONS] COMMAND [ARGS]...

  Automatically created group to organize subcommands

  This is a built in created group. To remove it, simply remove all its subcommands (with `clk command remove SUBCMD`,
  or `clk alias unset SUBCMD`). To rename it, simply rename them (with `clk command rename SUBCMD` or `clk alias rename
  SUBCMD`)

Options:
  --help-all  Show the full help message, automatic options included.
  --help      Show this message and exit.

Commands:
  do        Backup documents to external drive
  retrieve  Retrieve a file from backup
  verify    Verify backup integrity
```

I can call the backup command directly.

```bash
clk backup docs do
```

    Backing up documents from ~/docs to /media/external/documents

Or use the subcommands.

```bash
clk backup docs verify
clk backup docs retrieve important-notes.txt
```

    Verifying backup integrity at /media/external/documents...
    Retrieving important-notes.txt from /media/external/documents


<a id="org925c995"></a>

# chaining backups with flows

My documents reference database entries, so I want to ensure the database is backed up before backing up documents. I use flow dependencies.

```bash
clk flowdep set backup.docs.do backup.database
```

    New global flowdep for backup.docs.do: backup.database

Now when I run `backup docs do` with `--flow`, it first backs up the database.

```bash
clk backup docs do --flow
```

    Dumping database main.db to /media/external/documents
    Backing up documents from ~/docs to /media/external/documents


<a id="org8098521"></a>

# creating a full backup alias

I want a single command to back up everything. I create an alias that chains all backup commands.

```bash
clk alias set backup.full backup database , backup docs do , backup photos
```

    New global alias for backup.full: backup database , backup docs do , backup photos

```bash
clk backup full
```

    Dumping database main.db to /media/external/documents
    Backing up documents from ~/docs to /media/external/documents
    Backing up photos with high quality to /media/external/documents


<a id="orgecc405e"></a>

# shortcut aliases for common scenarios

I create aliases for frequent backup patterns.

```bash
clk alias set backup.quick backup docs do --source '~/notes'
clk alias set backup.work backup docs do --source '~/work/documents'
```

    New global alias for backup.quick: backup docs do --source '~/notes'
    New global alias for backup.work: backup docs do --source '~/work/documents'

```bash
clk backup quick
clk backup work
```

    Backing up documents from ~/notes to /media/external/documents
    Backing up documents from ~/work/documents to /media/external/documents


<a id="orgb73bc95"></a>

# per-project backup configuration

Different projects have different backup needs. I use project-local parameters so backup commands do the right thing depending on where I am.

```bash
mkdir -p project-a && cd project-a && mkdir .clk
```

I set the source directory on the `backup.docs.do` command, and the destination on the `backup` group. Since the destination is on the group, it affects all backup commands in this project - documents, database, photos.

```bash
clk parameter set backup.docs.do --source ./documentation
clk parameter set backup --dest /mnt/backup/project-a
```

    New local parameters for backup.docs.do: --source ./documentation
    New local parameters for backup: --dest /mnt/backup/project-a

```bash
clk backup docs do
```

    Backing up documents from ./documentation to /mnt/backup/project-a

When I leave the project, global settings take over.

```bash
cd ..
clk backup docs do
```

    Backing up documents from ~/docs to /media/external/documents
