doc/use_cases/backing_up_documents.org
* personal preferences with a hostname extension

I want my personal backup to go to my own NAS, regardless of any project I'm
in. The solution is to create an extension named after my hostname and put my
personal preferences there.

#+NAME: create-hostname-extension
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
clk extension create "$(hostname)"
#+END_SRC

I set my personal backup destination inside this extension.

#+NAME: set-hostname-params
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk parameter --extension "$(hostname)" set backup --dest /mnt/my-nas/documents
#+END_SRC

#+RESULTS[f0a06af9ce66159b816a933612addfc9e74ce7a5]: set-hostname-params
: New global/myhostname parameters for backup: --dest /mnt/my-nas/documents


Outside any project, the extension's destination is used.

#+NAME: run-with-hostname
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: run-with-hostname
: Backing up documents from ~/docs to /media/external/documents

Inside a project that defines its own ~--dest~, the project-local parameters
take precedence. This is useful when a shared project needs a specific backup
destination that everyone on the team should use.

#+NAME: enter-project-a-hostname
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
cd project-a
#+END_SRC

#+NAME: run-in-project-a-hostname
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup docs do
#+END_SRC

#+RESULTS[6ac099e1f8d9a7a71fa425bb837d0c80f99fe4ca]: run-in-project-a-hostname
: Backing up documents from ./documentation to /mnt/backup/project-a

Note that clk will always enable the extension matching your hostname, even if
you explicitly disable it in a project. Let's try it.

#+NAME: try-disable-hostname
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk extension disable "$(hostname)"
clk extension show | grep myhostname
#+END_SRC

#+RESULTS[165d082fabc4b59d1a0567e58771270d9086058b]: try-disable-hostname
: myhostname        local            global

Even after disabling, the hostname extension remains active. This is practical
to put personal preferences that apply everywhere, while still respecting
project-specific overrides when they exist.

#+NAME: leave-project-a-hostname
#+BEGIN_SRC bash :results none :exports code :session f8a2b3c4-d5e6-7890-abcd-ef1234567891
cd ..
clk extension remove "$(hostname)"
#+END_SRC

* seeing everything at a glance

As the backup system grows, I can see all available commands with ~--help~.

#+NAME: final-help
#+BEGIN_SRC bash :results verbatim :exports both :session f8a2b3c4-d5e6-7890-abcd-ef1234567891 :cache yes
clk backup --help
#+END_SRC

#+RESULTS[c68e489e34c5f4a54025f419fd5515006eeddcff]: final-help
#+begin_example
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  The current parameters set for this command are: --dest /media/external/documents

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  database  Backup database
  docs      Automatically created group to organize subcommands
  full      Alias for: backup database , backup docs do , backup...
  photos    Backup photos
  quick     Alias for: backup docs do --source '~/notes'
  work      Alias for: backup docs do --source '~/work/documents'
#+end_example

This gives me a complete overview: the core commands (~database~, ~docs~,
~photos~), the convenience aliases (~full~, ~quick~, ~work~), and I can drill
down into any group for more details.

* summary

This use case demonstrates several clk patterns working together:

- *shared environment variables*: the ~backup~ group sets ~BACKUP_DESTINATION~ for all subcommands
- *hierarchical commands*: ~backup.docs.do~, ~backup.database~ organize naturally
- *auto-created groups*: creating ~backup.docs.do~ automatically creates the ~docs~ group
- *persisted parameters*: set once on the group, used by all subcommands
- *flow dependencies*: chain dependent operations
- *aliases*: create shortcuts for common patterns
- *per-project config*: same command, different behavior based on location
- *hostname extensions*: personal preferences that apply globally

Starting from a single backup command, we built a complete backup system that's
easy to use, easy to extend, and self-documenting through ~--help~.

#+BEGIN_SRC bash :exports none :tangle ../../tests/use_cases/backing_up_documents.sh :noweb yes :shebang "#!/bin/bash -eu"
<<init>>

<<create-backup-group>>

<<create-backup>>

<<create-backup-docs-do>>

check-result(try-backup-docs-do)

check-result(show-backup-help)

check-result(set-dest-param)

check-result(try-with-param)

check-result(override-param)

<<create-backup-database>>

<<create-backup-photos>>

check-result(show-backup-commands)

check-result(try-all-backups)

<<create-docs-verify>>

<<create-docs-retrieve>>

check-result(show-docs-group)

check-result(call-docs-do)

check-result(call-docs-subcommands)

check-result(set-flowdep)

check-result(run-with-flow)

check-result(create-full-alias)

check-result(run-full-backup)

check-result(create-shortcuts)

check-result(try-shortcuts)

<<setup-project-a>>

check-result(set-project-a-params)

check-result(run-in-project-a)

check-result(leave-project)

<<create-hostname-extension>>

check-result(set-hostname-params)

check-result(run-with-hostname)

<<enter-project-a-hostname>>

check-result(run-in-project-a-hostname)

check-result(try-disable-hostname)

<<leave-project-a-hostname>>

check-result(final-help)
#+END_SRC
