doc/use_cases/backing_up_documents.md


<a id="org9e9eb34"></a>

# personal preferences with a hostname extension

I want my personal backup to go to my own NAS, regardless of any project I'm in. The solution is to create an extension named after my hostname and put my personal preferences there.

```bash
clk extension create "$(hostname)"
```

I set my personal backup destination inside this extension.

```bash
clk parameter --extension "$(hostname)" set backup --dest /mnt/my-nas/documents
```

    New global/myhostname parameters for backup: --dest /mnt/my-nas/documents

Outside any project, the extension's destination is used.

```bash
clk backup docs do
```

    Backing up documents from ~/docs to /media/external/documents

Inside a project that defines its own `--dest`, the project-local parameters take precedence. This is useful when a shared project needs a specific backup destination that everyone on the team should use.

```bash
cd project-a
```

```bash
clk backup docs do
```

    Backing up documents from ./documentation to /mnt/backup/project-a

Note that clk will always enable the extension matching your hostname, even if you explicitly disable it in a project. Let's try it.

```bash
clk extension disable "$(hostname)"
clk extension show | grep myhostname
```

    myhostname        local            global

Even after disabling, the hostname extension remains active. This is practical to put personal preferences that apply everywhere, while still respecting project-specific overrides when they exist.

```bash
cd ..
clk extension remove "$(hostname)"
```


<a id="orgbe45cf5"></a>

# seeing everything at a glance

As the backup system grows, I can see all available commands with `--help`.

```bash
clk backup --help
```

```
Usage: clk backup [OPTIONS] COMMAND [ARGS]...

  Backup operations

  The current parameters set for this command are: --dest /media/external/documents

  Edit this custom command by running `clk command edit backup`
  Or edit ./clk-root/python/backup.py directly.

Options:
  --dest TEXT  Backup destination base directory  [default: /mnt/backup]
  --help-all   Show the full help message, automatic options included.
  --help       Show this message and exit.

Commands:
  database  Backup database
  docs      Automatically created group to organize subcommands
  full      Alias for: backup database , backup docs do , backup...
  photos    Backup photos
  quick     Alias for: backup docs do --source '~/notes'
  work      Alias for: backup docs do --source '~/work/documents'
```

This gives me a complete overview: the core commands (`database`, `docs`, `photos`), the convenience aliases (`full`, `quick`, `work`), and I can drill down into any group for more details.


<a id="org2582d36"></a>

# summary

This use case demonstrates several clk patterns working together:

-   **shared environment variables**: the `backup` group sets `BACKUP_DESTINATION` for all subcommands
-   **hierarchical commands**: `backup.docs.do`, `backup.database` organize naturally
-   **auto-created groups**: creating `backup.docs.do` automatically creates the `docs` group
-   **persisted parameters**: set once on the group, used by all subcommands
-   **flow dependencies**: chain dependent operations
-   **aliases**: create shortcuts for common patterns
-   **per-project config**: same command, different behavior based on location
-   **hostname extensions**: personal preferences that apply globally

Starting from a single backup command, we built a complete backup system that's easy to use, easy to extend, and self-documenting through `--help`.
